src/config/Documents/НачислениеБонусовНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>НачислениеБонусовНаТовары</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыПоТоварам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаМРИЦ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бонус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/БонусыПоТоварам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>БонусыПоТоварам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Бонус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФиксЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаМриц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/InformationRegisters/ЦеныКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЦеныКлиента</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>&gt;100 это фикс.цена,    &gt;= -100 и &lt;0  или &gt;0 и &lt;=100 это доп. скидки/наценка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Documents/НачислениеБонусовНаТовары/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ЕстьУжеПроведенныйДокумент(Дата) тогда
		Отказ = Истина;
		#Если Клиент тогда
			Сообщить("Уже есть документ Начисление бонусов по номенклатуре за выбранный период!", СтатусСообщения.Внимание);
		#КонецЕсли	
	КонецЕсли;
	
	// регистр БонусыПоТоварам 
	Если НЕ Отказ тогда
		Движения.БонусыПоТоварам.Записывать = Истина;
		Движения.БонусыПоТоварам.Очистить();
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.БонусыПоТоварам.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовары);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

функция ЕстьУжеПроведенныйДокумент(Дата1)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НачислениеБонусовНаТовары.Ссылка
	|ИЗ
	|	Документ.НачислениеБонусовНаТовары КАК НачислениеБонусовНаТовары
	|ГДЕ
	|	НачислениеБонусовНаТовары.Дата>=&ДатаНач
	|	И НачислениеБонусовНаТовары.Дата<=&ДатаКон
	|	И НачислениеБонусовНаТовары.Проведен
	|	И НачислениеБонусовНаТовары.ссылка<>&ЭтотДокументСсылка";
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Дата1) );
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Дата1) );
	Запрос.УстановитьПараметр("ЭтотДокументСсылка",ссылка);
	Результат = Запрос.Выполнить();
	возврат НЕ результат.Пустой();	
КонецФункции	

процедура ЗаполнитьБонусы(флДиски=Истина) Экспорт
		
	// ТОЛЬКО по товарам с фикс.ценой>0 на дату документа
	Если Дата <> НачалоМесяца(Дата) тогда
		Дата = НачалоМесяца(Дата);
	КонецЕсли;	
	таблТов = ПолучитьТаблицуТоваровСФиксЦеной(Дата, флДиски);
	масТов  = таблТов.ВыгрузитьКолонку("Номенклатура"); //массив
	
	КлиентМРИЦ  = справочники.Контрагенты.НайтиПоКоду("11011");
	таблЦенМРИЦ = ОбменСУТИнтернетМагазин.ПолучитьЦеныДляКонтрагента_РегСв(КлиентМРИЦ, масТов);
	
	Товары.Очистить();
	Для i=0 по таблТов.Количество()-1 цикл
		стр0 = таблТов[i];
		стр1 = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стр1, стр0);
		стр1.ЦенаМриц = таблЦенМРИЦ.Найти(стр0.Номенклатура,"Номенклатура").МинимальнаяЦена;
		стр1.Бонус 	  = (стр1.ЦенаМриц - стр1.ФиксЦена) * стр0.Количество;
	КонецЦикла;

КонецПроцедуры

//04.10.2017 - для учёта бонусов ИМ
функция ПолучитьТаблицуТоваровСФиксЦеной(Дата1, флДиски)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.Период КАК Период,
	               |	ПродажиОбороты.Номенклатура,
	               |	МАКСИМУМ(ЦеныКлиентаСрезПоследних.Цена) КАК ФиксЦена,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, День, 
				   |			ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж = &НаправлениеПродажИМ
				   |//флДиски   И Номенклатура.ВидТовара = Значение(Перечисление.ВидыТоваров.Диски)
				   |		) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныКлиента.СрезПоследних( &ДатаКон,
	               |				Контрагент = &КонтрИМ
	               |//флДиски   И Номенклатура.ВидТовара = Значение(Перечисление.ВидыТоваров.Диски)
				   |					И Цена > 0) КАК ЦеныКлиентаСрезПоследних
	               |		ПО ПродажиОбороты.Номенклатура = ЦеныКлиентаСрезПоследних.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Период,
	               |	ПродажиОбороты.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) > 0
	               |	И МАКСИМУМ(ЦеныКлиентаСрезПоследних.Цена) > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Если флДиски тогда
	Запрос.Текст = стрЗаменить(Запрос.Текст ,"//флДиски","");				   
	КонецЕсли;				   
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(НачалоМесяца(Дата1)-1) );
	Запрос.УстановитьПараметр("ДатаКон", НачалоМесяца(Дата1)-1 );
	Запрос.УстановитьПараметр("КонтрИМ", справочники.Контрагенты.НайтиПоКоду("94291")  ); //  для ценообразования KOLESATYT
	Запрос.УстановитьПараметр("НаправлениеПродажИМ", справочники.НаправленияПродаж.НайтиПоКоду(16) ); //18. "Колеса ТУТ"
	Результат   = Запрос.Выполнить();
	таблФиксЦен = Результат.Выгрузить();
	Возврат таблФиксЦен;
КонецФункции
